// =============================================================================
//   o__ __o     o          o      o__ __o                    o__ __o     o
//  <|     v\   <|\        <|>    /v     v\                  /v     v\   <|>
//  / \     <\  / \\o      / \   />       <\                />       <\  < >
//  \o/     o/  \o/ v\     \o/  _\o____          o__ __o    \o            |
//   |__  _<|    |   <\     |        \_\__o__   /v     v\    |>_          o__/_
//   |       \  / \    \o  / \             \   />       <\   |            |
//  <o>      /  \o/     v\ \o/   \         /   \         /  <o>           |
//   |      o    |       <\ |     o       o     o       o    |            o
//  / \  __/>   / \        < \    <\__ __/>     <\__ __/>   / \           <\__
//
// =============================================================================
//
// All Rights Reserved.
// Any use of this source code is subject to a license agreement with the BNSoft
//
// Contact URL : www.bns.co.kr.
// =============================================================================
// =============================================================================
// api (module definition)
// backend server api endpoint와 연결되는 라우터영역
// =============================================================================
const express = require('express');
const router = express.Router();


// // =============================================================================
// // Controller 연결 영역
// // 각 API 엔드포인트에서 사용할 컨트롤러 정의
// // =============================================================================
// //controller연결 영역

const chatController = require('../controllers/chatController');
// // =============================================================================
// // API 라우터 정의
// // 클라이언트 요청을 받아 적절한 컨트롤러 함수 실행
// // =============================================================================
// // //router연결 영역
router.post('/sendToChat', chatController.sendToChat);
router.post('/expireSession', chatController.expireSession);
//router연결 영역 끝



module.exports = router;
